from pyrogram import Client, filters
from pyrogram.errors import FloodWait
from time import sleep
app = Client(
    "my_account",
    api_id=2546689,
    api_hash="ee2252f11cba4349dbb09fb33259fe80"
)

@app.on_message(filters.me)
def matdestroer(client, message):
    try:
        sentence = message.text
        sentence2 = sentence
        sentence = sentence.lower()
        
        modifiers = {'долбоеб': 'дебил', 'еблан': 'плохой', 'конченный': 'недоразвитый', 'хуй': 'фиг', 'хуйня': 'фигня', 'хуета': 'фигня', 'гондон': 'тварь', 'заебись': 'класс', 'хер': 'фиг', 'ахуеть': 'афигеть', 'долбоёб': 'дебил', 'конч': 'тупой', 'хз': 'хочу знать', 'кд': 'Привет, как дела?', 'хуесос': 'подлиза', 'уебище': 'просто не хороший человек', 'пидр': 'хэй', 'пидор': 'гэй', 'пидарас': 'гэище', 'хуеглот': 'глотатель', 'сьебался': 'ушел', 'с хуя': 'с чего это', 'ебал': 'манал', 'ебать': 'фига се', 'соси': 'иди нафиг', 'соси хуй': 'люби мой фиг', 'шлюха': 'девушка легкого поведения', 'Надим': 'Налим', 'Турик': 'Тупик', 'турик': 'тупик', 'надим': 'налим', 'Эрик': 'Эдик', 'эрик': 'эдик', 'ебаный': "тупой", ')': '(｡◕‿◕｡)', 'мудак': 'муduck', 'мудило': 'муDylo', '!': '(╯°□°）╯︵ ┻━┻', '?': 'ಠ_ಠ', 'гг': 'го гулять?', 'бб': 'удачи!', '(:': '(ಥ﹏ಥ)', 'блядь': 'капздец', 'пиздец': 'ёклмн', 'пизда': 'баба', 'член': 'ствол', 'трахать': 'nsfw телодвижения', 'трахаю': 'nsfw телодвижения', 'трахаться': 'nsfw телодвижения', 'трахатся': 'nsfw телодвижения', 'ебаца': 'nsfw телодвижения', 'ебаться': 'nsfw телодвижения', 'ебатся': 'nsfw телодвижения', 'уебок': 'идиот', 'спиздил': 'зацыганил', 'спиздили': 'зацыганили', 'Рамазан': 'цыган', 'Рушан': 'макака', 'Денчик': 'Денчик слазит', 'Денис': 'Пенис, дада оч смешно, ага ага', 'Лилиана': 'бодипозитив не значит быть жирной девкой легкого поведения', 'Аделина': 'дырка Турика', 'бравл старс': 'бровь стаса', 'камень': 'cumень', 'камаз': 'cumass', 'ебланоид': 'идиот', 'ебланина': 'тварина', 'отель': 'Trivago'}
        
        for i, v in modifiers.items():
            sentence = sentence.replace(i, v)
                
        if sentence2.lower() == sentence:
            message.edit(sentence2)
        else:
            tbp = ''
            typing_symbol = "♚"
            text = sentence
            while tbp != sentence:
                try:
                    
                    message.edit(tbp + typing_symbol)
                    sleep(0.01)
                    tbp = tbp + text[0]
                    text = text[1:]

                    message.edit(tbp)
                    sleep(0.01)
                except FloodWait as e:
                    sleep(e.x)
            
    except:
        pass
app.run()
